cask_args appdir: "/Applications"

# dotfiles manager
brew "chezmoi"

# dev tools manager
brew "mise"

# Vim
brew "neovim"

# Utility commands
brew "eza"
brew "fd"
brew "bat"
brew "ripgrep"
brew "git-delta"
brew "jnv"
brew "jq"
brew "direnv"

# GitHub
brew "git"
brew "gh"
brew "pre-commit"

# gRPC
brew "buf"

# Database
brew "libpq"
brew "mysql-client"
brew "sqlfluff"

cask "raycast"
cask "wezterm@nightly"
cask "slack"
cask "visual-studio-code"
cask "docker-desktop"
cask "gcloud-cli"
