cask_args appdir: "/Applications"

# dev tools manager
brew "mise"

# Vim
brew "vim"

# Utility commands
brew "eza"
brew "fd"
brew "bat"
brew "ripgrep"
brew "git-delta"
brew "jnv"
brew "jq"
brew "direnv"

# GitHub
brew "git"
brew "gh"
brew "pre-commit"

# gRPC
brew "buf"

# Database
brew "libpq"
brew "mysql-client"
brew "sqlfluff"

# Terraform
brew "tfenv"
brew "tflint"

# AWS
brew "awscli"

cask "raycast"
cask "wezterm@nightly"
cask "slack"
cask "visual-studio-code"
cask "zoom"
cask "docker-desktop"
cask "discord"
cask "gcloud-cli"

mas "LINE", id: 539883307
mas "Bitwarden", id: 1352778147
