cask_args appdir: "/Applications"

# Utility commands
brew "eza"
brew "fd"
brew "bat"
brew "ripgrep"
brew "git-delta"

# GitHub
brew "git"
brew "gh"

# gRPC
brew "grpcurl"
brew "bufbuild/buf/buf"

# Database
brew "libpq"
brew "mysql-client"
brew "goose"
brew "sqlfluff"

# Golang
brew "go"
brew "golangci-lint"

# Node.js
brew "nvm"

# Terraform
brew "tfenv"
brew "tflint"

# AWS
brew "awscli"
brew "aws-vault"

cask "slack"
cask "google-chrome"
cask "visual-studio-code"
cask "zoom"
cask "warp"
cask "docker"
cask "discord"
cask "brave-browser"
cask "google-cloud-sdk"

mas "LINE", id: 539883307
mas "Bitwarden", id: 1352778147
