golang.Go
PKief.material-icon-theme
Equinusocio.vsc-material-theme
foxundermoon.shell-format
ms-azuretools.vscode-docker
ms-vscode-remote.vscode-remote-extensionpack
zxh404.vscode-proto3
ms-vscode.makefile-tools
redhat.vscode-yaml
oderwat.indent-rainbow
mechatroner.rainbow-csv
hashicorp.terraform

shd101wyy.markdown-preview-enhanced
DavidAnson.vscode-markdownlint

tomoki1207.pdf
